OpenNuvoton/M55M1BSP/SampleCode/StdDriver/HSUSBH_USBH_MassStorage/main.c
    /* Lock protected registers */
    SYS_LockReg();
}

/*
 * This is a template project for NuMicro TC8263 series MCU. Users could based on this project to create their
 * own application without worry about the IAR/Keil project settings.
 *
 * This template application uses external crystal as HCLK source and configures DEBUG_PORT to print out
 * "Hello World", users may need to do extra system configuration based on their system design.
 */
int32_t main(void)
{
    char        *ptr, *ptr2;
    long        p1, p2, p3;
    BYTE        *buf;
    FATFS       *fs;              /* Pointer to file system object */
    TCHAR       usb_path[] = { '3', ':', 0 };    /* USB drive started from 3 */
    FRESULT     res;

    DIR dir;                /* Directory object */
    UINT s1, s2, cnt, sector_no;
    static const BYTE ft[] = {0, 12, 16, 32};
    DWORD ofs = 0, sect = 0;

    SYS_Init();                        /* Init System, IP clock and multi-function I/O */

    InitDebugUart();                   /* Init DeubgUART for printf */

    enable_sys_tick(100);

    printf("\n\n");
    printf("+-----------------------------------------------+\n");
    printf("|                                               |\n");
    printf("|     USB Host Mass Storage sample program      |\n");
    printf("|                                               |\n");
    printf("+-----------------------------------------------+\n");

    Buff = (BYTE *)((uint32_t)&Buff_Pool[0]);
    Buff2 = (BYTE *)((uint32_t)&Buff_Pool2[0]);

    usbh_core_init();
    usbh_umas_init();

    usbh_pooling_hubs();

    printf("Init time: %d\n", get_ticks());

    int_in_cnt = int_out_cnt = iso_in_cnt = iso_out_cnt = 0;

    f_chdrive(usb_path);               /* set default path                                */

    for (;;)
    {

        usbh_pooling_hubs();

        usbh_memory_used();            /* print out UsbHostLib memory usage information   */

        printf(_T(">"));
        ptr = Line;

        get_line(ptr, sizeof(Line));

        switch (*ptr++)
        {

            case 'q' :  /* Exit program */
                return 0;

            case '5':
                for (sector_no = 0; sector_no < 128000; sector_no++)
                {
                    if (sector_no % 1000 == 0)
                        printf("\nLBK transfer count: Ii:%d, Io: %d, Si:%d, So:%d\n", int_in_cnt, int_out_cnt, iso_in_cnt, iso_out_cnt);

                    printf("Test sector %d\r", sector_no);

                    memset(buff1, 87, 512);
                    memset(buff2, 0x87, 512);

                    res = (FRESULT)disk_read(3, buff1, sector_no, 1);

                    if (res)
                    {
                        printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                        put_rc(res);
                        break;
                    }

                    res = (FRESULT)disk_read(3, buff2, sector_no, 1);

                    if (res)
                    {
                        printf("read failed at %d, rc=%d\n", sector_no, (WORD)res);
                        put_rc(res);
                        break;
                    }

                    if (memcmp(buff1, buff2, 512) != 0)
                    {
                        printf("\nData compare failed!!\n");
                        break;
                    }
                }

                break;

            case '4' :
            case '6' :
            case '7' :
                ptr--;
                *(ptr + 1) = ':';
                *(ptr + 2) = 0;
                put_rc(f_chdrive((TCHAR *)ptr));
                break;

            case 'd' :
                switch (*ptr++)
                {
                    case 'd' :  /* dd [<lba>] - Dump sector */
                        if (!xatoi(&ptr, &p2)) p2 = sect;

                        res = (FRESULT)disk_read(3, Buff, p2, 1);

                        if (res)
                        {
                            printf("rc=%d\n", (WORD)res);
                            break;
                        }

                        sect = p2 + 1;
                        printf("Sector:%d\n", (INT)p2);

                        for (buf = (unsigned char *)Buff, ofs = 0; ofs < 0x200; buf += 16, ofs += 16)
                            put_dump(buf, ofs, 16);

                        break;

                    case 't' :  /* dt - raw sector read/write performance test */
                        printf("Raw sector read performance test...\n");
                        timer_init();

                        for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                        {
                            s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                            res = (FRESULT)disk_read(3, Buff, 10000 + s1 * s2, s2);

                            if (res)
                            {
                                printf("read failed at %d, rc=%d\n", 10000 + s1 * s2, (WORD)res);
                                put_rc(res);
                                break;
                            }

                            if (s1 % 256 == 0)
                                printf("%d KB\n", (s1 * BUFF_SIZE) / 1024);
                        }

                        p1 = get_timer_value();
                        printf("time = %d.%02d\n", (INT)(p1 / 100), (INT)(p1 % 100));
                        printf("Raw read speed: %d KB/s\n", (INT)(((0x800000 * 100) / p1) / 1024));

                        printf("Raw sector write performance test...\n");
                        timer_init();

                        for (s1 = 0; s1 < (0x800000 / BUFF_SIZE); s1++)
                        {
                            s2 = BUFF_SIZE / 512;   /* sector count for each read  */
                            res = (FRESULT)disk_write(3, Buff, 20000 + s1 * s2, s2);

                            if (res)
                            {
                                printf("write failed at %d, rc=%d\n", 20000 + s1 * s2, (WORD)res);
                                put_rc(res);
                                break;
                            }

